In [2]:
# 1) 1)	Create Empty data frame, how to check data frame is empty or not and append values to it
import pandas as pd
import numpy as np
Empty_Datadrame = pd.DataFrame()
print(Empty_Datadrame)

Empty DataFrame
Columns: []
Index: []

In [3]:
#2)2)	Rename(index,columns) a data frame with example
data_f = pd.DataFrame({'id':[1,2,3],'Name':['Bala','Sudha','Rushi'],'Compnay':['Accenture','Accenture','Accenture']})

In [8]:
data_f.rename(columns={'Name':'name'})

   id   name    Compnay
0   1   Bala  Accenture
1   2  Sudha  Accenture
2   3  Rushi  Accenture

In [9]:
Bala = data_f.reset_index()

In [10]:
Bala.rename(columns={'index':'Index'})

   Index  id   Name    Compnay
0      0   1   Bala  Accenture
1      1   2  Sudha  Accenture
2      2   3  Rushi  Accenture

In [12]:
#3)	how to know the data frame size? What is the function to describe about the table info in pands?
sizeofDF = pd.DataFrame({'one':[1,2,3,4],'two':[5,6,7,8]})
sizeofDF.size
#with describe function will get all numerical data summary reprot with mean, std, mx..etc

8

In [13]:
#4)	If we have file with 100GB but system RAM size is 6GB, than how we will load and analyze that file?
#Ans: we have to load the less than 3GB of data by using (nrows)

In [14]:
#5)	Write function to know missing value count and percentages columns of data frame by using lamda.

In [15]:
#6)	Difference between iloc and loc?
#ANS#iloc is the index value and loc is index label

In [16]:
#7)	Write examples for dropping column and rows of data frame?
#drop colum 
Bala.drop(columns='index')

   id   Name    Compnay
0   1   Bala  Accenture
1   2  Sudha  Accenture
2   3  Rushi  Accenture

In [17]:
#Drop row
Bala.drop(index=2)

   index  id   Name    Compnay
0      0   1   Bala  Accenture
1      1   2  Sudha  Accenture

In [18]:
#8)	Write a program to drop index columns and reindex the same.
index_drop = Bala.drop(columns='index')
index_drop

   id   Name    Compnay
0   1   Bala  Accenture
1   2  Sudha  Accenture
2   3  Rushi  Accenture

In [22]:
#Resent index
re_index = index_drop.reset_index()

In [23]:
re_index

   index  id   Name    Compnay
0      0   1   Bala  Accenture
1      1   2  Sudha  Accenture
2      2   3  Rushi  Accenture

In [30]:
#9)	Write a function for  frequency for categorical variables?
#json data is not loading

In [31]:
#11)	Describe about smaple() function: will get the random data from data set 
re_index.sample(2)

   index  id   Name    Compnay
1      1   2  Sudha  Accenture
0      0   1   Bala  Accenture

In [39]:
#10)	Write a function for summary stats of numerical data with below columns ["min","5%","25%","50%","mean","75%", "max", "std", "count", "missing%","lo","ho"]
#Json data is not loading

In [40]:
#NUmpy:
#1)	Difference between Shallow copy and deep copy
#ANs: shallow copy it will overwrite the actual data do if do any changes any data set 
#Deepcopy: deepcopy it won't overwrite the orginal data

In [42]:
#2)	Create two dimensions array with zeros and ones
two_dimension = np.array([0,0]),([1,1])

In [43]:
two_dimension

(array([0, 0]), [1, 1])

In [45]:
#3)	Create one dimensional array with integer values(1-40) and filter them with >20
one_dimension1 = np.array(range(1,40))